experiments/results/thesis/DPFS-NULL-MT/T2/MT_4/fio_randread_4k_8_1_2.out
"randread_4k_8_1": (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=8
fio-3.28
Starting 1 thread

"randread_4k_8_1": (groupid=0, jobs=1): err= 0: pid=71034: Fri Aug 11 21:37:52 2023
  read: IOPS=143k, BW=558MiB/s (585MB/s)(32.7GiB/60001msec)
    slat (nsec): min=2020, max=37537, avg=2747.59, stdev=572.01
    clat (usec): min=22, max=393, avg=52.64, stdev=19.17
     lat (usec): min=29, max=396, avg=55.49, stdev=19.12
    clat percentiles (usec):
     |  1.00th=[   33],  5.00th=[   36], 10.00th=[   39], 20.00th=[   44],
     | 30.00th=[   46], 40.00th=[   49], 50.00th=[   52], 60.00th=[   54],
     | 70.00th=[   57], 80.00th=[   59], 90.00th=[   63], 95.00th=[   68],
     | 99.00th=[  178], 99.50th=[  219], 99.90th=[  239], 99.95th=[  245],
     | 99.99th=[  255]
   bw (  KiB/s): min=519960, max=581888, per=100.00%, avg=571022.24, stdev=5934.24, samples=120
   iops        : min=129990, max=145472, avg=142755.53, stdev=1483.60, samples=120
  lat (usec)   : 50=44.38%, 100=54.58%, 250=1.02%, 500=0.02%
  cpu          : usr=20.77%, sys=43.04%, ctx=2355543, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8564688,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=558MiB/s (585MB/s), 558MiB/s-558MiB/s (585MB/s-585MB/s), io=32.7GiB (35.1GB), run=60001-60001msec