experiments/results/thesis/DPFS-NULL-MT/T2/MT_4/fio_randwrite_16k_2_1_3.out
"randwrite_16k_2_1": (g=0): rw=randwrite, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=io_uring, iodepth=2
fio-3.28
Starting 1 thread

"randwrite_16k_2_1": (groupid=0, jobs=1): err= 0: pid=73633: Fri Aug 11 22:08:24 2023
  write: IOPS=37.0k, BW=579MiB/s (607MB/s)(33.9GiB/60001msec); 0 zone resets
    slat (nsec): min=3207, max=44277, avg=4462.18, stdev=600.21
    clat (usec): min=12, max=326, avg=48.55, stdev=16.03
     lat (usec): min=44, max=331, avg=53.11, stdev=16.04
    clat percentiles (usec):
     |  1.00th=[   44],  5.00th=[   45], 10.00th=[   45], 20.00th=[   46],
     | 30.00th=[   46], 40.00th=[   46], 50.00th=[   47], 60.00th=[   47],
     | 70.00th=[   47], 80.00th=[   48], 90.00th=[   49], 95.00th=[   50],
     | 99.00th=[  169], 99.50th=[  184], 99.90th=[  198], 99.95th=[  202],
     | 99.99th=[  210]
   bw (  KiB/s): min=567200, max=604224, per=100.00%, avg=592545.59, stdev=9258.18, samples=120
   iops        : min=35450, max=37764, avg=37034.07, stdev=578.64, samples=120
  lat (usec)   : 20=0.01%, 50=94.88%, 100=3.60%, 250=1.52%, 500=0.01%
  cpu          : usr=10.02%, sys=22.89%, ctx=2208002, majf=0, minf=0
  IO depths    : 1=0.0%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2221911,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
  WRITE: bw=579MiB/s (607MB/s), 579MiB/s-579MiB/s (607MB/s-607MB/s), io=33.9GiB (36.4GB), run=60001-60001msec